Autodesk.Revit.DB.ToposolidType.SetContourSettting(Autodesk.Revit.DB.ContourSetting)
Set the contour setting for the current toposolid type by copying from an existing contour setting object.
setting:
An existing contour setting object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025